Revit 2027 API
ContinuousRail.GetStartExtensionPath Method
 Retrieves the start extension path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetStartExtensionPath()
Public Function GetStartExtensionPath As IList(Of Curve)
public:
IList<Curve^>^ GetStartExtensionPath()
member GetStartExtensionPath : unit -> IList<Curve>
Return Value
IList<Curve>
 The start extension path of the rail.
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace